doc/doc.org
#+TITLE: YAJET -- JavaScript template engine
#+STYLE: <link rel="stylesheet" type="text/css" href="docstyle.css" />

* Yet Another JavaScript Template Engine

A “template engine” is a tool able to transform some text into another, by
interpreting/replacing various patterns in the source text.  YAJET is such a
tool designed for client-side (JavaScript, in-browser) transformation.

YAJET is a compiler, in the sense that it transforms your template into
runnable JavaScript code; after compiling a template you get a function
which you can call with an argument that contains data required to fill your
template, and it returns it rendered.

YAJET is appropriate for any kind of text templates -- it was not designed
specifically for HTML, although that's mostly what we use it for.  It shares
some conceptual similarities with the venerable [[http://template-toolkit.org/][Template::Toolkit]] and some
syntactic ones with Lisp.  I decided to write it because I couldn't find
other tools to match my taste.

* Features

Other than the boring variable replacement, YAJET supports the following
(and I will explain them later in this document):

- conditionals (=IF= / =WHEN= / =UNLESS=, =ELSE=, =ELSIF=).  =WHEN= is a
  synonym to =IF=, and =UNLESS= is, of course, the complete opposite.
  =ELSE= and =ELSIF= are supported both in =IF/WHEN= and in =UNLESS= blocks,
  but using =ELSE= in an =UNLESS= block makes the code look a bit werid.

- repetitive constructs (=REPEAT= / =LOOP=).  They allow you to repeat a
  part of the template a few times. =LOOP= is a synonym to =REPEAT=.

- iterating array or hashes (=MAP= and =MAPHASH=) -- =MAP= to traverse a
  list and =MAPHASH= to iterate an object (hash table).

- all loops can be controlled by =BREAK= or =CONTINUE=.

- variable definition (=LET=, =VAR= and =WITH=).  =LET= and =WITH= introduce
  new lexical scopes.

- block definitions (=BLOCK= and =FUNCTION=).  Useful to define a template
  block that can be called as a function.  =BLOCK= will feed its output into
  the main output stream, while =FUNCTION= will return it.  Both are
  closures within their lexical context.

- block wrappers can be called using =WRAP=.

- simple filters a la Template::Toolkit (i.e. =$foo|html= will HTML-escape
  the value of foo).

- the documentation is bigger than the code.

* Usage

You need to load [[./js/yajet.js][yajet.js]], and to create an instance like this:

#+BEGIN_EXAMPLE
var yajet = new YAJET({
    syntax_char : "$",
    with_scope  : false
    filters     : {
        foo: function(val) { ... },
        bar: function(val) { ... }
    }
});
#+END_EXAMPLE

All arguments are optional.  Then to compile a template, you do this:

#+BEGIN_EXAMPLE
var func = yajet.compile("You said: $this.foo $this.bar");
#+END_EXAMPLE

and to execute it:

#+BEGIN_EXAMPLE
alert( func({ foo: "hello", bar: "world!" }) );
#+END_EXAMPLE

The function created by “yajet.compile” receives one argument, and that
argument is available in your templates via the JavaScript =this= keyword.
This is the default behavior, because I think it's the best one in general,
but if you don't like to use the =this.= prefix to access the members you
can pass =with_scope: true= in the constructor.  It wraps the generated
function in a =with(this) { ... }= block, so the above would become:

#+BEGIN_EXAMPLE
var yajet = new YAJET({ with_scope: true });
var func = yajet.compile("You said: $foo $bar");
// and call it the same:
alert( func({ foo: "hello", bar: "world!" }) );
#+END_EXAMPLE

It's more convenient, but it's slower (more than 10 times slower in many
cases).  How much slower depends on how big is your template and how many
variables there are.  If you want a performance benchmark with and without
the =with= statement, [[./test/with.html][see this file]] (Firebug is required for timing the
operations; watch the Firebug console).

* Syntax

YAJET parses the template as text, leaving it unchanged, until an occurrence
of a special character (let's name it the “reader char”).  By default this
character is $, but you can change it in the constructor.  What follows in
this document will assume that $ is the reader character.  A few types of
constructs are recognized:

- =$$= -- inserts a literal $ character.

- =$foo= -- inserts the value of the variable foo.

- =${ foo.bar.baz() }= -- evaluates the given JavaScript expression and
  inserts the return value, if any.

- =$(INSTRUCTION ... $)= -- processes the contents according to some rules
  which are particular for INSTRUCTION

- =$( ... )= -- inserts literal JavaScript code (must not be ill-formed!).

** Simple interpolation (the =$foo= construct)

To insert a variable you can say =$foo=, =$foo.bar=, etc.  This case is
quite simple.  The parser will stop at a character which isn't a letter, a
digit, an underscore or a dollar sign.  Additionally it supports filtering
the values with a convenient syntax: =$foo|html=.

Filters are functions that take one argument and should return the modified
value.  You can easily define your own filters (but later on this).  Filters
can be combined, for example: =$foo|upcase|html= will first make foo
uppercase, then apply the html filter to the upcased string.

