doc/doc.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>YAJET &ndash; JavaScript template engine</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-04-30 16:04:17 CEST"/>
<meta name="author" content="Mihai Bazon"/>
<link rel="stylesheet" type="text/css" href="docstyle.css" />
</head><body>
<h1 class="title">YAJET &ndash; JavaScript template engine</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Yet Another JavaScript Template Engine </a></li>
<li><a href="#sec-2">2 Features </a></li>
<li><a href="#sec-3">3 Usage </a></li>
<li><a href="#sec-4">4 Syntax </a>
<ul>
<li><a href="#sec-4.1">4.1 Simple interpolation (the <code>$foo</code> construct) </a></li>
<li><a href="#sec-4.2">4.2 JavaScript expressions (the <code>${exp}</code> construct) </a>
<ul>
<li><a href="#sec-4.2.1">4.2.1 Filters </a></li>
</ul>
</li>
<li><a href="#sec-4.3">4.3 Processing instructions </a>
<ul>
<li><a href="#sec-4.3.1">4.3.1 <code>IF</code> / <code>WHEN</code> / <code>UNLESS</code>, <code>ELSE</code> / <code>ELSIF</code> &ndash; conditional execution </a></li>
<li><a href="#sec-4.3.2">4.3.2 <code>REPEAT</code> / <code>LOOP</code> &ndash; to repeat stuff </a></li>
<li><a href="#sec-4.3.3">4.3.3 <code>MAP</code> / <code>FOREACH</code> &ndash; iterate an array </a></li>
<li><a href="#sec-4.3.4">4.3.4 <code>MAPHASH</code> &ndash; iterate an object (hash) </a></li>
<li><a href="#sec-4.3.5">4.3.5 <code>LET</code> and <code>VAR</code> &ndash; define variables </a></li>
<li><a href="#sec-4.3.6">4.3.6 <code>WITH</code> &ndash; modify the scope chain </a></li>
<li><a href="#sec-4.3.7">4.3.7 <code>BLOCK</code> and <code>FUNCTION</code> &ndash; define reusable template blocks </a></li>
<li><a href="#sec-4.3.8">4.3.8 <code>WRAP</code>, <code>CONTENT</code> &ndash; call a wrapper with an additional block of text </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Name </a></li>
<li><a href="#sec-6">6 Known issues and limitations </a>
<ul>
<li><a href="#sec-6.1">6.1 Literal RegExp-s in JavaScript expressions </a></li>
<li><a href="#sec-6.2">6.2 Filters don't take additional arguments </a></li>
<li><a href="#sec-6.3">6.3 Error reporting less than ideal </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Yet Another JavaScript Template Engine </h2>
<div id="text-1">


<p>
A “template engine” is a tool able to transform some text into another, by
interpreting/replacing various patterns in the source text.  YAJET is such a
tool designed for client-side (JavaScript, in-browser) transformation.
</p>
<p>
YAJET is a compiler, in the sense that it transforms your template into
runnable JavaScript code; after compiling a template you get a function
which you can call with an argument that contains data required to fill your
template, and it returns it rendered.
</p>
<p>
YAJET is appropriate for any kind of text templates &ndash; it was not designed
specifically for HTML, although that's mostly what we use it for.  It shares
some conceptual similarities with the venerable <a href="http://template-toolkit.org/">Template::Toolkit</a> and some
syntactic ones with Lisp.  I decided to write it because I couldn't find
other tools to match my taste.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Features </h2>
<div id="text-2">


<p>
Other than the boring variable replacement, YAJET supports the following
(and I will explain them later in this document):
</p>
<ul>
<li>
conditionals (<code>IF</code> / <code>WHEN</code> / <code>UNLESS</code>, <code>ELSE</code>, <code>ELSIF</code>).  <code>WHEN</code> is a
synonym to <code>IF</code>, and <code>UNLESS</code> is, of course, the complete opposite.
<code>ELSE</code> and <code>ELSIF</code> are supported both in <code>IF/WHEN</code> and in <code>UNLESS</code> blocks,
but using <code>ELSE</code> in an <code>UNLESS</code> block makes the code look a bit werid.

</li>
<li>
repetitive constructs (<code>REPEAT</code> / <code>LOOP</code>).  They allow you to repeat a
part of the template a few times. <code>LOOP</code> is a synonym to <code>REPEAT</code>.

</li>
<li>
iterating array or hashes (<code>MAP</code> and <code>MAPHASH</code>) &ndash; <code>MAP</code> to traverse a
list and <code>MAPHASH</code> to iterate an object (hash table).

</li>
<li>
all loops can be controlled by <code>BREAK</code> or <code>CONTINUE</code>.

</li>
<li>
variable definition (<code>LET</code>, <code>VAR</code> and <code>WITH</code>).  <code>LET</code> and <code>WITH</code> introduce
new lexical scopes.

</li>
<li>
block definitions (<code>BLOCK</code> and <code>FUNCTION</code>).  Useful to define a template
block that can be called as a function.  <code>BLOCK</code> will feed its output into
the main output stream, while <code>FUNCTION</code> will return it.  Both are
closures within their lexical context.

</li>
<li>
block wrappers can be called using <code>WRAP</code>.

</li>
<li>
simple filters a la Template::Toolkit (i.e. <code>$foo|html</code> will HTML-escape
the value of foo).

</li>
<li>
the documentation is bigger than the code.

</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Usage </h2>
<div id="text-3">


<p>
You need to load <a href="./js/yajet.js">yajet.js</a>, and to create an instance like this:
</p>



<pre class="example">
var yajet = new YAJET({
    syntax_char : "$",
    with_scope  : false
    filters     : {
        foo: function(val) { ... },
        bar: function(val) { ... }
    }
});
</pre>




<p>
All arguments are optional.  Then to compile a template, you do this:
</p>



<pre class="example">
var func = yajet.compile("You said: $this.foo $this.bar");
</pre>




<p>
and to execute it:
</p>



<pre class="example">
alert( func({ foo: "hello", bar: "world!" }) );
</pre>




<p>
The function created by “yajet.compile” receives one argument, and that
argument is available in your templates via the JavaScript <code>this</code> keyword.
This is the default behavior, because I think it's the best one in general,
but if you don't like to use the <code>this.</code> prefix to access the members you
can pass <code>with_scope: true</code> in the constructor.  It wraps the generated
function in a <code>with(this) { ... }</code> block, so the above would become:
</p>



<pre class="example">
var yajet = new YAJET({ with_scope: true });
var func = yajet.compile("You said: $foo $bar");
// and call it the same:
alert( func({ foo: "hello", bar: "world!" }) );
</pre>




<p>
It's more convenient, but it's slower (more than 10 times slower in many
cases).  How much slower depends on how big is your template and how many
variables there are.  If you want a performance benchmark with and without
the <code>with</code> statement, <a href="./test/with.html">see this file</a> (Firebug is required for timing the
operations; watch the Firebug console).
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">4 Syntax </h2>
<div id="text-4">


<p>
YAJET parses the template as text, leaving it unchanged, until an occurrence
of a special character (let's name it the “reader char”).  By default this
character is $, but you can change it in the constructor.  What follows in
this document will assume that $ is the reader character.  A few types of
constructs are recognized:
</p>
<ul>
<li>
<code>$$</code> &ndash; inserts a literal $ character.

</li>
<li>
<code>$foo</code> &ndash; inserts the value of the variable foo.

</li>
<li>
<code>${ foo.bar.baz() }</code> &ndash; evaluates the given JavaScript expression and
inserts the return value, if any.

</li>
<li>
<code>$(INSTRUCTION ... $)</code> &ndash; processes the contents according to some rules
which are particular for INSTRUCTION

</li>
<li>
<code>$( ... )</code> &ndash; inserts literal JavaScript code (must not be ill-formed!).

</li>
</ul>

</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1">4.1 Simple interpolation (the <code>$foo</code> construct) </h3>
<div id="text-4.1">


<p>
To insert a variable you can say <code>$foo</code>, <code>$foo.bar</code>, etc.  This case is
quite simple.  The parser will stop at a character which isn't a letter, a
digit, an underscore or a dollar sign.  Additionally it supports filtering
the values with a convenient syntax: <code>$foo|html</code>.
</p>
<p>
Filters are functions that take one argument and should return the modified
value.  You can easily define your own filters (but later on this).  Filters
can be combined, for example: <code>$foo|upcase|html</code> will first make foo
uppercase, then apply the html filter to the upcased string.
</p>
</div>

</div>
