doc/doc.org
** JavaScript expressions (the =${exp}= construct)

This is similar to the “simple interpolation” case, but it allows for more
complicated expressions.  For example =${a+b}= will insert the sum of a and
b.  Your expression can be arbitrarily complex, and the parser is smart
enough to read it, provided that it is valid JavaScript code (you need to be
*careful about literal RegExp-s* though, for now; I'll fix this in a later
release; more on this in [[Known issues]]).

So, an example of a perfectly valid call is:

#+BEGIN_EXAMPLE
${
   // Comments are allowed and can even contain the closing bracket: }
   // it's ignored, since it is in a comment.
   (function(arg){
     return arg.a + arg.b + arg.text;
   })({
     a: 5,
     b: 10,
     text: "(foo}"
   })
}
#+END_EXAMPLE

The =${exp}= construct will evaluate the expression =foo= at run-time and
will insert its value into the rendered template only if it's not =null=.

*** Filters

As already noted, the =$foo= construct allows filtering the value through
some function using a convenient syntax like =$foo|html=.  At the time of
this writing the filters available by default are:

- =html=
- =upcase=
- =downcase=

It's easy to define custom filters when you construct the YAJET object:

#+BEGIN_EXAMPLE
var yajet = new YAJET({
    filters: {
        md5: function(value) {
            return md5_hex_of(value); // return the modified value
        }
    }
});
#+END_EXAMPLE

... and in your template: =$password|md5=.

There is also a syntax that allows for filters within the =${exp}=
construct.  But since we parse valid JavaScript code, and since the pipe is
a valid JavaScript character (“bitwise or”), we have to use something
different.  The idea was, thus, that such expressions will be parsed as a
list; the first element of the list is the expression itself, and any
additional elements are filters.  For example:

#+BEGIN_EXAMPLE
${ this.getLabel(), upcase, html }
#+END_EXAMPLE

will convert into something like this (that's only pseudo-code):

#+BEGIN_EXAMPLE
output_string(
  apply_html_filter(
    apply_upcase_filter(
      this.getLabel()
    )
  )
)
#+END_EXAMPLE

Since the comma doesn't look very nice for this particular case, the “list
reader” also allows a few aliases.  Syntactic sugar, baby!  You can also
use:

- =“=>”=
- =“;”=
- =“..”=
- =“;”=

So the above example can also be written like this:

#+BEGIN_EXAMPLE
${ this.getLabel() => upcase => html }
${ this.getLabel() => upcase, html }
${ this.getLabel() .. upcase; html }
#+END_EXAMPLE

Whitespace is ignored.

These special separators only work for the “list reader” which is used in
the =${exp}=-like constructs.  Also, note that filters are only interpreted
in the top-level elements of this list, so for instance the following won't
apply the "html" filter to “foo”: =${ something(foo, html) }=.  It will just
call, instead, the function =something=, passing the variables =foo= and
=html=, which is expected behavior.

** Processing instructions

So far we are able to introduce arbitrary JavaScript variables and
expressions in the template.  However that's hardly enough.  First off, the
expressions must be well-formed, so there is no way to start a JavaScript
block somewhere and end it some place else.  The following is invalid for
obvious reasons:

#+BEGIN_EXAMPLE
${ if (link != null) { }
  <a href="$link|html">$link</a>
${ } }
#+END_EXAMPLE

I emphasize that the lack of support for partial expressions is a /feature/,
not a limitation.  This will never be “fixed”.  To support constructs like
the above but without encouraging poorly written templates that start a
block on line 10 and end it on line 1000, we have a few special processing
instructions.  Let's call these the =$(BAR ... $)= construct.  To start
with, here is how you would write the above code:

#+BEGIN_EXAMPLE
$(WHEN (link != null)
  <a href="$link|html">$link</a>
$)
#+END_EXAMPLE

Note that you still can start a block on one line and end it on another, but
the style is a bit different.  Instead of inserting arbitrary code
unconditionally, we simply end a known construct.  The condition that you
pass to WHEN must be fully valid JavaScript (you cannot pass a partial
expression there) and, if your editor does a good job about matching parens,
then you can quickly see where the block begins/ends by moving the cursor to
the parens.  I prefer this style.

Note that the processing instructions are not case-sensitive.  I prefer to
use UPPERCASE for them so that they stand out visually.

The =$(BAR ... $)= construct has the following properties:

- it starts with =$(= (so it's a normal paren, not a bracket).
- it has a special instruction.
- depending on the instruction, certain arguments may follow.
- it may contain a block of text between the arguments and the =$)=
  terminator.
- it /should/ end with =$)=.

The block of text is parsed normally, so it's interpreted as plain text
until =$= (the reader char) is encountered, then what follows the reader
char is processed by the rules I described in this document.  Despite all
this, the parser is not recursive. :-)

Following I will describe the processing instructions which are available at
this time.  I think the set of them is quite comprehensive and allows you to
express any kind of template in a simple and consistent manner.

*** =IF= / =WHEN= / =UNLESS=, =ELSE= / =ELSIF= -- conditional execution

=IF= and =WHEN= are synonyms, while =UNLESS= is the antonym.  =WHEN= seems more
appropriate for cases where you don't have an =ELSE= clause.  They support one
argument which must be a condition enclosed in parens.  Examples:

#+BEGIN_EXAMPLE
$(WHEN (user_id == null)
  <a href="...">Please login</a> $)

$(UNLESS (user_id != null)
  <a href="...">Please login</a> $)

$(IF (a < b)
  <p>A is smaller</p>
$(ELSIF (a > b))
  <p>B is smaller</p>
$(ELSE)
  <p>A and B are equal</p> $)
#+END_EXAMPLE

Note that you can use =ELSE= or =ELSIF= inside =UNLESS= or =WHEN= blocks
too, although I would not advise to use this style:

#+BEGIN_EXAMPLE
$(UNLESS (a == b)
  they are different
$(ELSE)
  they are equal $)
#+END_EXAMPLE

You should also note that =ELSE= and =ELSIF= are not actually parsed like
other instructions.  They don't take a block of text, and thus they don't
need to end with =$)=.  Whether to do it this way was hard to decide, but
since =ELSE= and =ELSIF= normally /continue/ an IF block, instead of ending
it, it seems to make sense this way.  The same applies to =$(BREAK)= and
=$(CONTINUE)= directives.

