doc/doc.html

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2">4.2 JavaScript expressions (the <code>${exp}</code> construct) </h3>
<div id="text-4.2">


<p>
This is similar to the “simple interpolation” case, but it allows for more
complicated expressions.  For example <code>${a+b}</code> will insert the sum of a and
b.  Your expression can be arbitrarily complex, and the parser is smart
enough to read it, provided that it is valid JavaScript code (you need to be
<b>careful about literal RegExp-s</b> though, for now; I'll fix this in a later
release; more on this in <a href="#sec-4.2">Known issues</a>).
</p>
<p>
So, an example of a perfectly valid call is:
</p>



<pre class="example">
${
   // Comments are allowed and can even contain the closing bracket: }
   // it's ignored, since it is in a comment.
   (function(arg){
     return arg.a + arg.b + arg.text;
   })({
     a: 5,
     b: 10,
     text: "(foo}"
   })
}
</pre>




<p>
The <code>${exp}</code> construct will evaluate the expression <code>foo</code> at run-time and
will insert its value into the rendered template only if it's not <code>null</code>.
</p>

</div>

<div id="outline-container-4.2.1" class="outline-4">
<h4 id="sec-4.2.1">4.2.1 Filters </h4>
<div id="text-4.2.1">


<p>
As already noted, the <code>$foo</code> construct allows filtering the value through
some function using a convenient syntax like <code>$foo|html</code>.  At the time of
this writing the filters available by default are:
</p>
<ul>
<li>
<code>html</code>
</li>
<li>
<code>upcase</code>
</li>
<li>
<code>downcase</code>

</li>
</ul>

<p>It's easy to define custom filters when you construct the YAJET object:
</p>



<pre class="example">
var yajet = new YAJET({
    filters: {
        md5: function(value) {
            return md5_hex_of(value); // return the modified value
        }
    }
});
</pre>




<p>
&hellip; and in your template: <code>$password|md5</code>.
</p>
<p>
There is also a syntax that allows for filters within the <code>${exp}</code>
construct.  But since we parse valid JavaScript code, and since the pipe is
a valid JavaScript character (“bitwise or”), we have to use something
different.  The idea was, thus, that such expressions will be parsed as a
list; the first element of the list is the expression itself, and any
additional elements are filters.  For example:
</p>



<pre class="example">
${ this.getLabel(), upcase, html }
</pre>




<p>
will convert into something like this (that's only pseudo-code):
</p>



<pre class="example">
output_string(
  apply_html_filter(
    apply_upcase_filter(
      this.getLabel()
    )
  )
)
</pre>




<p>
Since the comma doesn't look very nice for this particular case, the “list
reader” also allows a few aliases.  Syntactic sugar, baby!  You can also
use:
</p>
<ul>
<li>
<code>“=&gt;”</code>
</li>
<li>
<code>“;”</code>
</li>
<li>
<code>“..”</code>
</li>
<li>
<code>“;”</code>

</li>
</ul>

<p>So the above example can also be written like this:
</p>



<pre class="example">
${ this.getLabel() =&gt; upcase =&gt; html }
${ this.getLabel() =&gt; upcase, html }
${ this.getLabel() .. upcase; html }
</pre>




<p>
Whitespace is ignored.
</p>
<p>
These special separators only work for the “list reader” which is used in
the <code>${exp}</code>-like constructs.  Also, note that filters are only interpreted
in the top-level elements of this list, so for instance the following won't
apply the "html" filter to “foo”: <code>${ something(foo, html) }</code>.  It will just
call, instead, the function <code>something</code>, passing the variables <code>foo</code> and
<code>html</code>, which is expected behavior.
</p>
</div>
</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3">4.3 Processing instructions </h3>
<div id="text-4.3">


<p>
So far we are able to introduce arbitrary JavaScript variables and
expressions in the template.  However that's hardly enough.  First off, the
expressions must be well-formed, so there is no way to start a JavaScript
block somewhere and end it some place else.  The following is invalid for
obvious reasons:
</p>



<pre class="example">
${ if (link != null) { }
  &lt;a href="$link|html"&gt;$link&lt;/a&gt;
${ } }
</pre>




<p>
I emphasize that the lack of support for partial expressions is a <i>feature</i>,
not a limitation.  This will never be “fixed”.  To support constructs like
the above but without encouraging poorly written templates that start a
block on line 10 and end it on line 1000, we have a few special processing
instructions.  Let's call these the <code>$(BAR ... $)</code> construct.  To start
with, here is how you would write the above code:
</p>



<pre class="example">
$(WHEN (link != null)
  &lt;a href="$link|html"&gt;$link&lt;/a&gt;
$)
</pre>




<p>
Note that you still can start a block on one line and end it on another, but
the style is a bit different.  Instead of inserting arbitrary code
unconditionally, we simply end a known construct.  The condition that you
pass to WHEN must be fully valid JavaScript (you cannot pass a partial
expression there) and, if your editor does a good job about matching parens,
then you can quickly see where the block begins/ends by moving the cursor to
the parens.  I prefer this style.
</p>
<p>
Note that the processing instructions are not case-sensitive.  I prefer to
use UPPERCASE for them so that they stand out visually.
</p>
<p>
The <code>$(BAR ... $)</code> construct has the following properties:
</p>
<ul>
<li>
it starts with <code>$(</code> (so it's a normal paren, not a bracket).
</li>
<li>
it has a special instruction.
</li>
<li>
depending on the instruction, certain arguments may follow.
</li>
<li>
it may contain a block of text between the arguments and the <code>$)</code>
terminator.
</li>
<li>
it <i>should</i> end with <code>$)</code>.

</li>
</ul>

<p>The block of text is parsed normally, so it's interpreted as plain text
until <code>$</code> (the reader char) is encountered, then what follows the reader
char is processed by the rules I described in this document.  Despite all
this, the parser is not recursive. :-)
</p>
<p>
Following I will describe the processing instructions which are available at
this time.  I think the set of them is quite comprehensive and allows you to
express any kind of template in a simple and consistent manner.
</p>

</div>

<div id="outline-container-4.3.1" class="outline-4">
<h4 id="sec-4.3.1">4.3.1 <code>IF</code> / <code>WHEN</code> / <code>UNLESS</code>, <code>ELSE</code> / <code>ELSIF</code> &ndash; conditional execution </h4>
<div id="text-4.3.1">


<p>
<code>IF</code> and <code>WHEN</code> are synonyms, while <code>UNLESS</code> is the antonym.  <code>WHEN</code> seems more
appropriate for cases where you don't have an <code>ELSE</code> clause.  They support one
argument which must be a condition enclosed in parens.  Examples:
</p>



<pre class="example">
$(WHEN (user_id == null)
  &lt;a href="..."&gt;Please login&lt;/a&gt; $)

$(UNLESS (user_id != null)
  &lt;a href="..."&gt;Please login&lt;/a&gt; $)

$(IF (a &lt; b)
  &lt;p&gt;A is smaller&lt;/p&gt;
$(ELSIF (a &gt; b))
  &lt;p&gt;B is smaller&lt;/p&gt;
$(ELSE)
  &lt;p&gt;A and B are equal&lt;/p&gt; $)
</pre>




<p>
Note that you can use <code>ELSE</code> or <code>ELSIF</code> inside <code>UNLESS</code> or <code>WHEN</code> blocks
too, although I would not advise to use this style:
</p>



<pre class="example">
$(UNLESS (a == b)
  they are different
$(ELSE)
  they are equal $)
</pre>




<p>
You should also note that <code>ELSE</code> and <code>ELSIF</code> are not actually parsed like
other instructions.  They don't take a block of text, and thus they don't
need to end with <code>$)</code>.  Whether to do it this way was hard to decide, but
since <code>ELSE</code> and <code>ELSIF</code> normally <i>continue</i> an IF block, instead of ending
it, it seems to make sense this way.  The same applies to <code>$(BREAK)</code> and
<code>$(CONTINUE)</code> directives.
</p>
</div>

</div>
