doc/doc.org
*** =REPEAT= / =LOOP= -- to repeat stuff

To repeat a part of the template you can use =REPEAT= or =LOOP= (they are
synonyms).  For example, the following outputs “foo” 3 times: =$(REPEAT (3)
foo $)=.  In various cases you might need to know the current iteration too,
so you can pass a variable name for it:

#+BEGIN_EXAMPLE
$(REPEAT (5, i)
  Item $i $)
#+END_EXAMPLE

The variable =i= takes values from 1 to 5 (inclusively) and the output will
be “Item 1 Item 2 ” etc.  In some cases you might want to specify an
interval (so that you start from something different than zero), so the
following is allowed:

#+BEGIN_EXAMPLE
$(LOOP (5 .. 10 => i)
  <a href="/page$i">Page $i</a> $)
#+END_EXAMPLE

=LOOP= seems to be nicer in this case, but the result is exactly the same if
you use =REPEAT= too.  Also note that the arguments are parsed using the
“list reader”, so you can use syntactic sugar to separate them (although a
simple comma would do).

*** =MAP= / =FOREACH= -- iterate an array

Again, =MAP= and =FOREACH= are synonyms.  You can use them to do something
for each element of an array.  For example the following outputs links
contained in an array:

#+BEGIN_EXAMPLE
$(MAP (link => links)
  <a href="$link.address|html"
     title="$link.tooltip|html">$link.text|html</a> $)
#+END_EXAMPLE

That's assuming that =links= is an array of objects, each containing
=address=, =tooltip= and =text=.  You could also use a literal object (the
parser is smart enough for this):

#+BEGIN_EXAMPLE
$(MAP (link => [ { address : "http://www.google.com/",
                   tooltip : "Search engine",
                   text    : "Google" },

                 { address : "http://www.ymacs.org/",
                   tooltip : "AJAX code editor",
                   text    : "Ymacs" }
               ])
  <a href="$link.address|html"
     title="$link.tooltip|html">$link.text|html</a> $)
#+END_EXAMPLE

Sometimes you also need to know the current step of the iteration.  For
example if you want to output some links that are separated with a pipe, you
need to know not to output the pipe before the first, or after the last
link.  We could write it like this:

#+BEGIN_EXAMPLE
$(MAP (i, link => links)
  $(WHEN (i > 0) | $)
  <a href="$link.address|html"
     title="$link.tooltip|html">$link.text|html</a> $)
#+END_EXAMPLE

or

#+BEGIN_EXAMPLE
$(MAP (i, link => links)
  ${ i > 0 ? "|" : "" }
  <a href="$link.address|html"
     title="$link.tooltip|html">$link.text|html</a> $)
#+END_EXAMPLE

A special case of =MAP= / =FOREACH= allows you to pass only the array, and
no key or index variables.  In this case the special variable =$_= (which I
will call the Perlism) gets assigned to the current element, and /more/, the
loop body is lexically scoped to each element using a JavaScript =with=
block (I know, your mom told you not to play the =with= statement, but mine
didn't[fn:with] :-p).

So using this style the first example would become:

#+BEGIN_EXAMPLE
$(MAP (links)
  <a href="$address|html" title="$tooltip|html">$text|html</a> $)
#+END_EXAMPLE

=address=, =tooltip= and =text= access the specific property of each
element.

Just a last example showing the Perlism:

#+BEGIN_EXAMPLE
$(FOREACH ([ "foo", "bar", "baz" ]) <b>$_</b> $)
#+END_EXAMPLE

will output “<b>foo</b> <b>bar</b> <b>baz</b>”.  The =$_= variable is bound
to each element.

*** =MAPHASH= -- iterate an object (hash)

=MAPHASH= is =MAP='s analogue for hashes.  It iterates over all properties
of an object, binding a variable for the key and another for the value.  You
must specify names for these variables.  Example, assuming that =users= is a
hash that maps user IDs to some user objects (each of them having a
=getName()= method):

#+BEGIN_EXAMPLE
$(MAPHASH (uid, obj => users)
  User <b>$uid</b> has name <b>${ obj.getName() }</b><br /> $)
#+END_EXAMPLE

*** =LET= and =VAR= -- define variables

You can define new variables with =LET= and =VAR=.  They are not equivalent:
=LET= introduces a new lexical scope, so the variables that you define are
only available in its block of text.  =VAR= on the other hand introduces
variables that you can use anywhere in your template.  Note that they are
/not global variables/--they are still local to the template function.

=VAR= does not accept a block of text, so it ends directly with a closing
paren.  Example:

#+BEGIN_EXAMPLE
$(VAR ((a => 10) (b => 20)))
$a + $b = ${ a + b }
#+END_EXAMPLE

If variables with the same name were previously defined, they are replaced
with the new ones.

=LET= introduces variables that are local to its block.  If variables with
the same name already exist, they are shadowed while the =LET= block is
rendered.  After the =LET= block ends, previous values come back to life.

#+BEGIN_EXAMPLE
$(LET ((a => 10) (b => 20))
  $a + $b = ${ a + b }
$)
#+END_EXAMPLE

Since =LET= takes a block of text, it ends with the normal block terminator
=$)=.  Here's an example to demonstrate scope:

#+BEGIN_EXAMPLE
$(VAR ((x => "outside")))
$(LET ((x => 10))
  $x is 10
  $(LET ((x => 20))
    $x is 20
  $)
  $x is back 10
$)
$x is "outside"
#+END_EXAMPLE

=LET= operates by introducing an anonymous function, so it is compatible
with all browsers.  Firefox introduced a =let= statement for declaring
block-scoped variables, but unfortunately no other browser supports it at
the moment.

*** =WITH= -- modify the scope chain

When you have an object that has properties you need to access, you can use
a =WITH= block to make for a more convenient syntax, so instead of saying
=$object.foo= you would be able to say only =$foo=.  Assuming that =link=
contains =address=, =tooltip= and =text=, the following two are equivalent:

#+BEGIN_EXAMPLE
<a href="$link.address|html" title="$link.tooltip|html">$link.text|html</a>

$(WITH (link)
  <a href="$address|html" title="$tooltip|html">$text|html</a>
$)
#+END_EXAMPLE

=WITH= can be used with literal objects as well:

#+BEGIN_EXAMPLE
$(WITH ({ foo: 10, bar: 20 })
  $foo + $bar = ${ foo + bar }
$)
#+END_EXAMPLE

thus emulating a =LET= block, but it's less efficient because it uses the
[[https://developer.mozilla.org/en/Core_JavaScript_1.5_Reference/Statements/with][JavaScript with statement]].  I did some tests and for a really big number of
iterations (1000000) with an iterator variable defined with =with= instead
of =var=, the =with= block is 10 times slower.  That's very unfortunate
because what we can do with it is quite interesting.  Still, it's fast
enough for most use cases.

