doc/doc.html

<div id="outline-container-4.3.2" class="outline-4">
<h4 id="sec-4.3.2">4.3.2 <code>REPEAT</code> / <code>LOOP</code> &ndash; to repeat stuff </h4>
<div id="text-4.3.2">


<p>
To repeat a part of the template you can use <code>REPEAT</code> or <code>LOOP</code> (they are
synonyms).  For example, the following outputs “foo” 3 times: <code>$(REPEAT (3) foo $)</code>.  In various cases you might need to know the current iteration too,
so you can pass a variable name for it:
</p>



<pre class="example">
$(REPEAT (5, i)
  Item $i $)
</pre>




<p>
The variable <code>i</code> takes values from 1 to 5 (inclusively) and the output will
be “Item 1 Item 2 ” etc.  In some cases you might want to specify an
interval (so that you start from something different than zero), so the
following is allowed:
</p>



<pre class="example">
$(LOOP (5 .. 10 =&gt; i)
  &lt;a href="/page$i"&gt;Page $i&lt;/a&gt; $)
</pre>




<p>
<code>LOOP</code> seems to be nicer in this case, but the result is exactly the same if
you use <code>REPEAT</code> too.  Also note that the arguments are parsed using the
“list reader”, so you can use syntactic sugar to separate them (although a
simple comma would do).
</p>
</div>

</div>

<div id="outline-container-4.3.3" class="outline-4">
<h4 id="sec-4.3.3">4.3.3 <code>MAP</code> / <code>FOREACH</code> &ndash; iterate an array </h4>
<div id="text-4.3.3">


<p>
Again, <code>MAP</code> and <code>FOREACH</code> are synonyms.  You can use them to do something
for each element of an array.  For example the following outputs links
contained in an array:
</p>



<pre class="example">
$(MAP (link =&gt; links)
  &lt;a href="$link.address|html"
     title="$link.tooltip|html"&gt;$link.text|html&lt;/a&gt; $)
</pre>




<p>
That's assuming that <code>links</code> is an array of objects, each containing
<code>address</code>, <code>tooltip</code> and <code>text</code>.  You could also use a literal object (the
parser is smart enough for this):
</p>



<pre class="example">
$(MAP (link =&gt; [ { address : "http://www.google.com/",
                   tooltip : "Search engine",
                   text    : "Google" },

                 { address : "http://www.ymacs.org/",
                   tooltip : "AJAX code editor",
                   text    : "Ymacs" }
               ])
  &lt;a href="$link.address|html"
     title="$link.tooltip|html"&gt;$link.text|html&lt;/a&gt; $)
</pre>




<p>
Sometimes you also need to know the current step of the iteration.  For
example if you want to output some links that are separated with a pipe, you
need to know not to output the pipe before the first, or after the last
link.  We could write it like this:
</p>



<pre class="example">
$(MAP (i, link =&gt; links)
  $(WHEN (i &gt; 0) | $)
  &lt;a href="$link.address|html"
     title="$link.tooltip|html"&gt;$link.text|html&lt;/a&gt; $)
</pre>




<p>
or
</p>



<pre class="example">
$(MAP (i, link =&gt; links)
  ${ i &gt; 0 ? "|" : "" }
  &lt;a href="$link.address|html"
     title="$link.tooltip|html"&gt;$link.text|html&lt;/a&gt; $)
</pre>




<p>
A special case of <code>MAP</code> / <code>FOREACH</code> allows you to pass only the array, and
no key or index variables.  In this case the special variable <code>$_</code> (which I
will call the Perlism) gets assigned to the current element, and <i>more</i>, the
loop body is lexically scoped to each element using a JavaScript <code>with</code>
block (I know, your mom told you not to play the <code>with</code> statement, but mine
didn't<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup> :-p).
</p>
<p>
So using this style the first example would become:
</p>



<pre class="example">
$(MAP (links)
  &lt;a href="$address|html" title="$tooltip|html"&gt;$text|html&lt;/a&gt; $)
</pre>




<p>
<code>address</code>, <code>tooltip</code> and <code>text</code> access the specific property of each
element.
</p>
<p>
Just a last example showing the Perlism:
</p>



<pre class="example">
$(FOREACH ([ "foo", "bar", "baz" ]) &lt;b&gt;$_&lt;/b&gt; $)
</pre>




<p>
will output “&lt;b&gt;foo&lt;/b&gt; &lt;b&gt;bar&lt;/b&gt; &lt;b&gt;baz&lt;/b&gt;”.  The <code>$_</code> variable is bound
to each element.
</p>
</div>

</div>

<div id="outline-container-4.3.4" class="outline-4">
<h4 id="sec-4.3.4">4.3.4 <code>MAPHASH</code> &ndash; iterate an object (hash) </h4>
<div id="text-4.3.4">


<p>
<code>MAPHASH</code> is <code>MAP</code>'s analogue for hashes.  It iterates over all properties
of an object, binding a variable for the key and another for the value.  You
must specify names for these variables.  Example, assuming that <code>users</code> is a
hash that maps user IDs to some user objects (each of them having a
<code>getName()</code> method):
</p>



<pre class="example">
$(MAPHASH (uid, obj =&gt; users)
  User &lt;b&gt;$uid&lt;/b&gt; has name &lt;b&gt;${ obj.getName() }&lt;/b&gt;&lt;br /&gt; $)
</pre>




</div>

</div>

<div id="outline-container-4.3.5" class="outline-4">
<h4 id="sec-4.3.5">4.3.5 <code>LET</code> and <code>VAR</code> &ndash; define variables </h4>
<div id="text-4.3.5">


<p>
You can define new variables with <code>LET</code> and <code>VAR</code>.  They are not equivalent:
<code>LET</code> introduces a new lexical scope, so the variables that you define are
only available in its block of text.  <code>VAR</code> on the other hand introduces
variables that you can use anywhere in your template.  Note that they are
<i>not global variables</i>&ndash;they are still local to the template function.
</p>
<p>
<code>VAR</code> does not accept a block of text, so it ends directly with a closing
paren.  Example:
</p>



<pre class="example">
$(VAR ((a =&gt; 10) (b =&gt; 20)))
$a + $b = ${ a + b }
</pre>




<p>
If variables with the same name were previously defined, they are replaced
with the new ones.
</p>
<p>
<code>LET</code> introduces variables that are local to its block.  If variables with
the same name already exist, they are shadowed while the <code>LET</code> block is
rendered.  After the <code>LET</code> block ends, previous values come back to life.
</p>



<pre class="example">
$(LET ((a =&gt; 10) (b =&gt; 20))
  $a + $b = ${ a + b }
$)
</pre>




<p>
Since <code>LET</code> takes a block of text, it ends with the normal block terminator
<code>$)</code>.  Here's an example to demonstrate scope:
</p>



<pre class="example">
$(VAR ((x =&gt; "outside")))
$(LET ((x =&gt; 10))
  $x is 10
  $(LET ((x =&gt; 20))
    $x is 20
  $)
  $x is back 10
$)
$x is "outside"
</pre>




<p>
<code>LET</code> operates by introducing an anonymous function, so it is compatible
with all browsers.  Firefox introduced a <code>let</code> statement for declaring
block-scoped variables, but unfortunately no other browser supports it at
the moment.
</p>
</div>

</div>

<div id="outline-container-4.3.6" class="outline-4">
<h4 id="sec-4.3.6">4.3.6 <code>WITH</code> &ndash; modify the scope chain </h4>
<div id="text-4.3.6">


<p>
When you have an object that has properties you need to access, you can use
a <code>WITH</code> block to make for a more convenient syntax, so instead of saying
<code>$object.foo</code> you would be able to say only <code>$foo</code>.  Assuming that <code>link</code>
contains <code>address</code>, <code>tooltip</code> and <code>text</code>, the following two are equivalent:
</p>



<pre class="example">
&lt;a href="$link.address|html" title="$link.tooltip|html"&gt;$link.text|html&lt;/a&gt;

$(WITH (link)
  &lt;a href="$address|html" title="$tooltip|html"&gt;$text|html&lt;/a&gt;
$)
</pre>




<p>
<code>WITH</code> can be used with literal objects as well:
</p>



<pre class="example">
$(WITH ({ foo: 10, bar: 20 })
  $foo + $bar = ${ foo + bar }
$)
</pre>




<p>
thus emulating a <code>LET</code> block, but it's less efficient because it uses the
<a href="https://developer.mozilla.org/en/Core_JavaScript_1.5_Reference/Statements/with">JavaScript with statement</a>.  I did some tests and for a really big number of
iterations (1000000) with an iterator variable defined with <code>with</code> instead
of <code>var</code>, the <code>with</code> block is 10 times slower.  That's very unfortunate
because what we can do with it is quite interesting.  Still, it's fast
enough for most use cases.
</p>
</div>

</div>
