doc/doc.org
*** =BLOCK= and =FUNCTION= -- define reusable template blocks

Both of these constructs define a function (local to your template) which
renders a text block.  The difference between them is that =BLOCK= will
define a function that “prints” the text block into the template output (and
returns nothing), while =FUNCTION= will just return it.

The syntax is straightforward.  They expect a name for the function,
followed by a list of arguments in parens.  If there are no arguments, put
=()= like you do for a plain JavaScript function.

#+BEGIN_EXAMPLE
$(BLOCK display_link(link)
  <a href="$link.address|html" title="$link.title|html">$link.text|html</a>
$)

<!-- call it literally -->
$( display_link({ address: "/", title="Home page", text: "Home" }) )

<!-- or call it for an object -->
$(FOREACH (i IN links)
  $( display_link(i) )
$)
#+END_EXAMPLE

As you see, using =BLOCK / FUNCTION= you can split your template into small
components.  Instead of having a big =FOREACH= loop that outputs a lot of
stuff, we can separate logical parts in blocks and then just call them, so
the loop itself becomes small.

Combining =BLOCK= and =LET= or =WITH= we can define closures:

#+BEGIN_EXAMPLE
$(WITH ({ value: 0 })
  $(BLOCK counter()
    <p>Counter is ${ ++value }</p> $) $)

$( counter() ) -- now it's 1
$( counter() ) -- now it's 2
$( counter() ) -- now it's 3
#+END_EXAMPLE

Doing the above with =LET= is a bit more tricky because =LET= creates its
own environment, so the =BLOCK= that you define within it is actually local
to the =LET= block.  The following won't work:

#+BEGIN_EXAMPLE
$(LET ((value => 0))
  $(BLOCK counter()
    <p>Counter is ${ ++value }</p> $) $)

$( counter() ) -- error, counter is not defined!
#+END_EXAMPLE

It's easy to see why if you see the code that gets generated for the above.
It looks like the following:

#+BEGIN_EXAMPLE
(function(){
    var value = 0;
    function counter() {
        output("Counter is " + (++value));
    };
})();
#+END_EXAMPLE

To do this with a =LET= block we would have to export the function; we can
use an outside variable for that:

#+BEGIN_EXAMPLE
$(VAR (counter))
$(LET ((value => 0))
  $( counter = _counter /* export it */ )
  $(BLOCK _counter()
    <p>Counter is ${ ++value }</p> $) $)

$( counter() ) -- now it works.
#+END_EXAMPLE

*** =WRAP=, =CONTENT= -- call a wrapper with an additional block of text

=BLOCK= can be used to define wrappers.  A wrapper is something that
receives a bit of text and puts something before and after that text.  For
example, to define a wrapper that creates a table we can say:

#+BEGIN_EXAMPLE
<!-- define our wrapper -->
$(BLOCK table(cols)
  <table>
    <thead>
      <tr>
        $(MAP (label => cols) <td>$label</td> $)
      </tr>
    </thead>
    <tbody>
      $(CONTENT)
    </tbody>
  </table> $)

<!-- and here's how we use it -->
$(WRAP table([ "Name", "Phone", "Email" ])
  <tr> <td>Foo</td> <td>123-1234</td> <td>foo@foo.com</td> </tr>
  <tr> <td>Bar</td> <td>1234-123</td> <td>bar@bar.com</td> </tr>
$)
#+END_EXAMPLE

You can note that a wrapper is a normal function defined with =BLOCK= or
=FUNCTION=, and it can take arguments.  To send the arguments with a =WRAP=
block, just make it look like a normal function call.  If there are no
arguments, you still need to insert the parens =()=.  When it's calling your
block, =WRAP= sends an additional hidden argument that contains the text
which is expanded by =$(CONTENT)=.  For now this argument is a function that
renders the text, and =$(CONTENT)= simply calls this function.








* Name

Various combinations of the letters Y, A, J, T, E from “Yet Another
JavaScript Template Engine” led to the name YAJET.  Sounds good, isn't it?



* Known issues and limitations

** Literal RegExp-s in JavaScript expressions

** Filters don't take additional arguments

** Error reporting less than ideal



#---- footnotes

[fn:with] Seriously though, everything under an =with= block is
s...l...o...w... -- so, while this makes for a nice syntax, you should not
use it where speed is critical.
