doc/doc.html

<div id="outline-container-4.3.7" class="outline-4">
<h4 id="sec-4.3.7">4.3.7 <code>BLOCK</code> and <code>FUNCTION</code> &ndash; define reusable template blocks </h4>
<div id="text-4.3.7">


<p>
Both of these constructs define a function (local to your template) which
renders a text block.  The difference between them is that <code>BLOCK</code> will
define a function that “prints” the text block into the template output (and
returns nothing), while <code>FUNCTION</code> will just return it.
</p>
<p>
The syntax is straightforward.  They expect a name for the function,
followed by a list of arguments in parens.  If there are no arguments, put
<code>()</code> like you do for a plain JavaScript function.
</p>



<pre class="example">
$(BLOCK display_link(link)
  &lt;a href="$link.address|html" title="$link.title|html"&gt;$link.text|html&lt;/a&gt;
$)

&lt;!-- call it literally --&gt;
$( display_link({ address: "/", title="Home page", text: "Home" }) )

&lt;!-- or call it for an object --&gt;
$(FOREACH (i IN links)
  $( display_link(i) )
$)
</pre>




<p>
As you see, using <code>BLOCK / FUNCTION</code> you can split your template into small
components.  Instead of having a big <code>FOREACH</code> loop that outputs a lot of
stuff, we can separate logical parts in blocks and then just call them, so
the loop itself becomes small.
</p>
<p>
Combining <code>BLOCK</code> and <code>LET</code> or <code>WITH</code> we can define closures:
</p>



<pre class="example">
$(WITH ({ value: 0 })
  $(BLOCK counter()
    &lt;p&gt;Counter is ${ ++value }&lt;/p&gt; $) $)

$( counter() ) -- now it's 1
$( counter() ) -- now it's 2
$( counter() ) -- now it's 3
</pre>




<p>
Doing the above with <code>LET</code> is a bit more tricky because <code>LET</code> creates its
own environment, so the <code>BLOCK</code> that you define within it is actually local
to the <code>LET</code> block.  The following won't work:
</p>



<pre class="example">
$(LET ((value =&gt; 0))
  $(BLOCK counter()
    &lt;p&gt;Counter is ${ ++value }&lt;/p&gt; $) $)

$( counter() ) -- error, counter is not defined!
</pre>




<p>
It's easy to see why if you see the code that gets generated for the above.
It looks like the following:
</p>



<pre class="example">
(function(){
    var value = 0;
    function counter() {
        output("Counter is " + (++value));
    };
})();
</pre>




<p>
To do this with a <code>LET</code> block we would have to export the function; we can
use an outside variable for that:
</p>



<pre class="example">
$(VAR (counter))
$(LET ((value =&gt; 0))
  $( counter = _counter /* export it */ )
  $(BLOCK _counter()
    &lt;p&gt;Counter is ${ ++value }&lt;/p&gt; $) $)

$( counter() ) -- now it works.
</pre>




</div>

</div>

<div id="outline-container-4.3.8" class="outline-4">
<h4 id="sec-4.3.8">4.3.8 <code>WRAP</code>, <code>CONTENT</code> &ndash; call a wrapper with an additional block of text </h4>
<div id="text-4.3.8">


<p>
<code>BLOCK</code> can be used to define wrappers.  A wrapper is something that
receives a bit of text and puts something before and after that text.  For
example, to define a wrapper that creates a table we can say:
</p>



<pre class="example">
&lt;!-- define our wrapper --&gt;
$(BLOCK table(cols)
  &lt;table&gt;
    &lt;thead&gt;
      &lt;tr&gt;
        $(MAP (label =&gt; cols) &lt;td&gt;$label&lt;/td&gt; $)
      &lt;/tr&gt;
    &lt;/thead&gt;
    &lt;tbody&gt;
      $(CONTENT)
    &lt;/tbody&gt;
  &lt;/table&gt; $)

&lt;!-- and here's how we use it --&gt;
$(WRAP table([ "Name", "Phone", "Email" ])
  &lt;tr&gt; &lt;td&gt;Foo&lt;/td&gt; &lt;td&gt;123-1234&lt;/td&gt; &lt;td&gt;foo@foo.com&lt;/td&gt; &lt;/tr&gt;
  &lt;tr&gt; &lt;td&gt;Bar&lt;/td&gt; &lt;td&gt;1234-123&lt;/td&gt; &lt;td&gt;bar@bar.com&lt;/td&gt; &lt;/tr&gt;
$)
</pre>




<p>
You can note that a wrapper is a normal function defined with <code>BLOCK</code> or
<code>FUNCTION</code>, and it can take arguments.  To send the arguments with a <code>WRAP</code>
block, just make it look like a normal function call.  If there are no
arguments, you still need to insert the parens <code>()</code>.  When it's calling your
block, <code>WRAP</code> sends an additional hidden argument that contains the text
which is expanded by <code>$(CONTENT)</code>.  For now this argument is a function that
renders the text, and <code>$(CONTENT)</code> simply calls this function.
</p>







</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">5 Name </h2>
<div id="text-5">


<p>
Various combinations of the letters Y, A, J, T, E from “Yet Another
JavaScript Template Engine” led to the name YAJET.  Sounds good, isn't it?
</p>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">6 Known issues and limitations </h2>
<div id="text-6">



</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1">6.1 Literal RegExp-s in JavaScript expressions </h3>
<div id="text-6.1">


</div>

</div>

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2">6.2 Filters don't take additional arguments </h3>
<div id="text-6.2">


</div>

</div>

<div id="outline-container-6.3" class="outline-3">
<h3 id="sec-6.3">6.3 Error reporting less than ideal </h3>
<div id="text-6.3">






</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> Seriously though, everything under an <code>with</code> block is
s&hellip;l&hellip;o&hellip;w&hellip; &ndash; so, while this makes for a nice syntax, you should not
use it where speed is critical.
</p>
</div>
</div>
<div id="postamble"><p class="author"> Author: Mihai Bazon
<a href="mailto:mihai.bazon@gmail.com">&lt;mihai.bazon@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2010-04-30 16:04:17 CEST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
